<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/xhtml;charset=UTF-8"/>
<title>Diamond Hunter: Main Page</title>
<link href="tabs.css" rel="stylesheet" type="text/css"/>
<link href="search/search.css" rel="stylesheet" type="text/css"/>
<script type="text/javascript" src="search/search.js"></script>
<link href="doxygen.css" rel="stylesheet" type="text/css"/>
</head>
<body onload='searchBox.OnSelectItem(0);'>
<!-- Generated by Doxygen 1.7.3 -->
<script type="text/javascript"><!--
var searchBox = new SearchBox("searchBox", "search",false,'Search');
--></script>
<div id="top">
<div id="titlearea">
<table cellspacing="0" cellpadding="0">
 <tbody>
 <tr style="height: 56px;">
  <td style="padding-left: 0.5em;">
   <div id="projectname">Diamond Hunter&#160;<span id="projectnumber">v 1.0</span></div>
  </td>
 </tr>
 </tbody>
</table>
</div>
  <div id="navrow1" class="tabs">
    <ul class="tablist">
      <li class="current"><a href="index.html"><span>Main&#160;Page</span></a></li>
      <li><a href="annotated.html"><span>Classes</span></a></li>
      <li><a href="files.html"><span>Files</span></a></li>
      <li id="searchli">
        <div id="MSearchBox" class="MSearchBoxInactive">
        <span class="left">
          <img id="MSearchSelect" src="search/mag_sel.png"
               onmouseover="return searchBox.OnSearchSelectShow()"
               onmouseout="return searchBox.OnSearchSelectHide()"
               alt=""/>
          <input type="text" id="MSearchField" value="Search" accesskey="S"
               onfocus="searchBox.OnSearchFieldFocus(true)" 
               onblur="searchBox.OnSearchFieldFocus(false)" 
               onkeyup="searchBox.OnSearchFieldChange(event)"/>
          </span><span class="right">
            <a id="MSearchClose" href="javascript:searchBox.CloseResultsWindow()"><img id="MSearchCloseImg" border="0" src="search/close.png" alt=""/></a>
          </span>
        </div>
      </li>
    </ul>
  </div>
</div>
<div class="header">
  <div class="headertitle">
<h1>Diamond Hunter Documentation</h1>  </div>
</div>
<div class="contents">
<div class="textblock"><h1>Diamond Hunter</h1>
<p><br/>
 </p>
<h2>Kapitel 1: Specifikation av Uppgift</h2>
<p><br/>
 <b>Grundideer f&ouml;r spelet</b> <br/>
 Sj&auml;lva iden med detta spel &auml;r att styra en spelkarakt&auml;r till att f&aring;nga s&aring; m&aring;nga skatter (diamanter) som m&ouml;jligt. N&auml;r man lyckats f&aring;nga in alla diamanter innan tiden har l&ouml;pt ut s&aring; har man klarat av en niv&aring; i spelet. Sv&aring;righetsniv&aring;n i spelet &ouml;kar efter var femte niv&aring;. Det inneb&auml;r att ytterligare en till diamant l&auml;ggs upp p&aring; spelplan bland de redan existerande diamanterna. Vid niv&aring; 10 s&aring; g&aring;r &auml;ven spelkarakt&auml;ren upp i niv&aring; och r&ouml;relsen p&aring; karakt&auml;ren f&ouml;rdubblas. Maximalt kan det finnas sju stycken diamanter samtidigt p&aring; spelplanen och tiden man har p&aring; sig att f&aring;nga in samtliga diamanter &auml;r konstant i hela spelet, d.v.s. 10 sekunder. Lyckas man ej att f&aring;nga in alla diamanter innan tiden l&ouml;pt ut s&aring; har man f&ouml;rlorat. <br/>
 <br/>
 <b>Gr&auml;nssnitt</b> <br/>
 Vid start av programmet hamnar man i spelets huvudmeny. I menyn finns tre val som anv&auml;ndaren kan v&auml;lja bland och alla val sk&ouml;ts med hj&auml;lp av tangentbordet. Vid val 1. startas sj&auml;lva spelet. Val 2. visas "om"-spelet, d.v.s. information om hur man spelar och i vilket programmeringsspr&aring;k det &auml;r skapat i. Val 3. avslutar spelet. Man styr sin spelkarakt&auml;r med hj&auml;lp av tangentbordets piltangenter och n&auml;r en diamant plockas upp uppdateras spelarens po&auml;ng, och denna information finner man uppe till v&auml;nster i f&ouml;nstret. Nedr&auml;kning av tiden finner man centralt upptill i f&ouml;nstret. N&auml;r spelaren g&aring;r upp i niv&aring; uppdateras &auml;ven detta i ett f&auml;lt h&ouml;gst upp i f&ouml;nstret, d&auml;r man &auml;ven finner "high score" som uppdateras n&auml;r spelaren misslyckas med en niv&aring; (game over) och om po&auml;ngen spelaren har &auml;r h&ouml;gre &auml;n det nuvarande "high score". Om man vill avsluta ett aktivt spel trycker man p&aring; Esc- tangenten. <br/>
 <br/>
 </p>
<center> <b>Sk&auml;rmdumpar</b><br/>
<br/>
 Meny<br/>
 </p>
<div align="center">
<img src="meny.jpg" alt="meny.jpg" width="320" height="240"/>
</div>
<p> <a href="meny.jpg">F&ouml;rstora bilden</a> <br/>
 Spelplan<br/>
 </p>
<div align="center">
<img src="spelet.jpg" alt="spelet.jpg" width="320" height="240"/>
</div>
<p> <a href="spelet.jpg">F&ouml;rstora bilden</a> <br/>
 Misslyckande<br/>
 </p>
<div align="center">
<img src="gameover.jpg" alt="gameover.jpg" width="320" height="240"/>
</div>
<p> <a href="gameover.jpg">F&ouml;rstora bilden</a> </center><p> <br/>
 <br/>
 </p>
<h2>Kapitel 2: Resultat och framtida f&ouml;rb&auml;ttringar</h2>
<p><br/>
 <b> Hur mycket hann vi implementera? </b> <br/>
 Ett enkelt fungerande spel som &auml;r l&auml;tt att f&ouml;rst&aring;. Det som jag hann med att implementera var en spelkarakt&auml;r med r&ouml;relseanimation. Spelplan. M&aring;lobjekt i form av diamanter som spelkarakt&auml;ren skall plocka upp. Timer f&ouml;r nedr&auml;kning. Grafisk meny. Po&auml;ngr&auml;kning och h&ouml;gsta uppn&aring;dda po&auml;ng. <br/>
 <br/>
 <b>Vad skulle kunna f&ouml;rb&auml;ttras?</b> <br/>
 En mer dynamisk spelplan d&auml;r olika hinder skulle kunna orsaka att spelaren m&aring;ste ta andra v&auml;gar f&ouml;r att n&aring; diamanterna, d.v.s. mer utmanande. Även variation p&aring; skatter (inte bara diamanter) som ger olika po&auml;ng till spelaren. F&ouml;rutom det skulle man kunna f&ouml;rb&auml;ttra misslyckanden i spelet. Att man ist&auml;llet f&aring;r po&auml;ngavdrag n&auml;r man inte hinner plocka upp alla diamanter ist&auml;llet f&ouml;r att det blir game over direkt. Och d&auml;r s&auml;tta en gr&auml;ns till fem missade diamanter leder till ett misslyckande (game over). <br/>
 <br/>
 <b>N&auml;sta version av programmet vad skulle det inneh&aring;lla j&auml;mf&ouml;rt med aktuell version</b> <br/>
 <br/>
 N&auml;sta version hade jag t&auml;nkt mig att man skall kunna v&auml;lja om man vill spela med en annan spelare (allts&aring; tv&aring; spelare samtidigt). D&aring; finns det tv&aring; spelkarakt&auml;rer p&aring; spelplanen och som styrs med tangentbordet, d&auml;r spelarna t&auml;vlar om vem som plockar mest diamanter under en satt tid. F&ouml;rutom det skulle nog en hel del av det som finns under f&ouml;rb&auml;ttring implementeras ocks&aring;. Variation av skatter ger olika po&auml;ng, en del hinder som st&aring;r i v&auml;gen f&ouml;r spelaren. <br/>
 <br/>
 <br/>
 <br/>
 </p>
<h6>Jim Olofsson<br/>
Dataingenj&ouml;rsprogrammet<br/>
&ouml;rebro Universitet</h6>
</div></div>
<!--- window showing the filter options -->
<div id="MSearchSelectWindow"
     onmouseover="return searchBox.OnSearchSelectShow()"
     onmouseout="return searchBox.OnSearchSelectHide()"
     onkeydown="return searchBox.OnSearchSelectKey(event)">
<a class="SelectItem" href="javascript:void(0)" onclick="searchBox.OnSelectItem(0)"><span class="SelectionMark">&#160;</span>All</a><a class="SelectItem" href="javascript:void(0)" onclick="searchBox.OnSelectItem(1)"><span class="SelectionMark">&#160;</span>Classes</a><a class="SelectItem" href="javascript:void(0)" onclick="searchBox.OnSelectItem(2)"><span class="SelectionMark">&#160;</span>Functions</a></div>

<!-- iframe showing the search results (closed by default) -->
<div id="MSearchResultsWindow">
<iframe src="" frameborder="0" 
        name="MSearchResults" id="MSearchResults">
</iframe>
</div>

<hr class="footer"/><address class="footer"><small>Generated on Fri Jan 14 2011 03:00:46 for Diamond Hunter by&#160;
<a href="http://www.doxygen.org/index.html">
<img class="footer" src="doxygen.png" alt="doxygen"/></a> 1.7.3 </small></address>
</body>
</html>
